app/controllers/railway_stations_controller.rb

SELECT "railway_stations".* FROM "railway_stations"
---
  def index
    @railway_stations = RailwayStation.all

INSERT INTO "railway_stations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Gthvm"], ["created_at", 2017-02-01 10:14:32 UTC], ["updated_at", 2017-02-01 10:14:32 UTC]]
---
  def create
    @railway_station = RailwayStation.new(railway_station_params)

    respond_to do |format|
      if @railway_station.save

DELETE FROM "railway_stations" WHERE "railway_stations"."id" = ?  [["id", 1]]
---
  def destroy
    @railway_station.destroy

SELECT  "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])