app/controllers/routes_controller.rb

INSERT INTO "routes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Пермь - Москва"], ["created_at", 2017-02-01 10:48:11 UTC], ["updated_at", 2017-02-01 10:48:11 UTC]]
---
  def create
    @route = Route.new(route_params)

    if @route.save